hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
// Multi-SSID NVS helpers (key form: w0s, w0p, w0t, w0i, w0g, w0m, w0d)
static String dashWifiKey(uint8_t slot, const char *sub)
{
    String k = "w";
    k += slot;
    k += sub;
    return k;
}
static void dashClearWifiNetwork(DashWifiNetwork &n)
{
    n.ssid[0] = 0;
    n.pass[0] = 0;
    n.useStatic = false;
    n.ip[0] = 0;
    n.gw[0] = 0;
    n.mask[0] = 0;
    n.dns[0] = 0;
}
static void dashRotateAndConnect();
static void dashSwapHandler(uint8_t mode);
static void dashApplyFilters();
static void dashApplyRuntimeState();
static void dashClearLegacyOptionPrefs();
static void dashLog(const String &s);

// CAN recorder
#ifndef REC_CAP
#define REC_CAP 8000
#endif
static constexpr unsigned long kRecMaxDurationMs = 60000UL;
struct RecFrame
{
    unsigned long ts;
    char dir;
    uint32_t id;
    uint8_t dlc;
    uint8_t data[8];
};
static RecFrame *recBuf = nullptr;
static bool recBufInPsram = false;
static volatile bool recActive = false;
static volatile int recCount = 0;
static bool recSaved = false;
static unsigned long recStartMs = 0;

// CAN sniffer ring buffer
#define SNIFFER_CAP 30
struct SniffFrame
{
    unsigned long ts;
    uint32_t id;
    uint8_t dlc;
    uint8_t data[8];
};
static SniffFrame sniffBuf[SNIFFER_CAP];
static int sniffHead = 0;
static int sniffCount = 0;

enum DashWriteProbeState : uint8_t
{
    kDashWriteProbeIdle = 0,
    kDashWriteProbePending = 1,
    kDashWriteProbeMatch = 2,
    kDashWriteProbeDifferent = 3,
    kDashWriteProbeFailed = 4,
};

struct DashWriteProbe
{
    bool active = false;
    bool hasRx = false;
    uint8_t state = kDashWriteProbeIdle;
    uint32_t id = 0;
    int8_t mux = -1;
    uint8_t txDlc = 0;
    uint8_t rxDlc = 0;
    uint8_t txData[8] = {};
    uint8_t rxData[8] = {};
    unsigned long txMs = 0;
    unsigned long rxMs = 0;
};
static DashWriteProbe dashWriteProbe;

static int8_t dashFrameMux(const CanFrame &frame)
{
    if ((frame.id == 1006 || frame.id == 1021) && frame.dlc > 0)
        return static_cast<int8_t>(readMuxID(frame));
    return -1;
}

static void dashResetWriteProbe()
{
    dashWriteProbe = {};
    dashWriteProbe.mux = -1;
    dashWriteProbe.state = kDashWriteProbeIdle;
}

static bool dashEnsureRecBuffer()
{
    if (recBuf)
        return true;
#if defined(CONFIG_SPIRAM) && CONFIG_SPIRAM
    recBuf = static_cast<RecFrame *>(heap_caps_calloc(REC_CAP, sizeof(RecFrame), MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
    if (recBuf)
    {
        recBufInPsram = true;
        Serial.println("[REC] Buffer allocated in PSRAM");
        return true;
    }
#endif
    recBuf = static_cast<RecFrame *>(heap_caps_calloc(REC_CAP, sizeof(RecFrame), MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    recBufInPsram = false;
    if (!recBuf)
    {
        Serial.println("[REC] Buffer allocation failed");
        return false;
    }
    Serial.println("[REC] Buffer allocated in internal RAM");
    return true;
}

static void dashReleaseRecBuffer()
{
    if (!recBuf || recActive)
        return;
    heap_caps_free(recBuf);
    recBuf = nullptr;
    recBufInPsram = false;
}

static bool dashSaveRecordingToSpiffs(int n)
{
    if (!recBuf)
    {
        dashLog("[REC] Save failed: buffer unavailable");
        return false;
    }
    if (n < 0)
        n = 0;
    if (n > REC_CAP)
        n = REC_CAP;

    File f = SPIFFS.open("/rec.csv", "w");
    if (!f)
    {
        dashLog("[REC] SPIFFS write failed");
        return false;
    }

    f.println("ts_ms,dir,id,dlc,b0,b1,b2,b3,b4,b5,b6,b7");
    char line[96];
    for (int i = 0; i < n; i++)
    {
        int len = snprintf(line, sizeof(line),
                           "%lu,%c,%lu,%u,%u,%u,%u,%u,%u,%u,%u,%u\n",
                           recBuf[i].ts,
                           recBuf[i].dir ? recBuf[i].dir : 'R',
                           static_cast<unsigned long>(recBuf[i].id),
                           static_cast<unsigned>(recBuf[i].dlc),
                           static_cast<unsigned>(recBuf[i].data[0]),
                           static_cast<unsigned>(recBuf[i].data[1]),
                           static_cast<unsigned>(recBuf[i].data[2]),
                           static_cast<unsigned>(recBuf[i].data[3]),
                           static_cast<unsigned>(recBuf[i].data[4]),
                           static_cast<unsigned>(recBuf[i].data[5]),
                           static_cast<unsigned>(recBuf[i].data[6]),
                           static_cast<unsigned>(recBuf[i].data[7]));
        if (len > 0)
            f.write(reinterpret_cast<const uint8_t *>(line),
                    static_cast<size_t>(len < static_cast<int>(sizeof(line)) ? len : sizeof(line) - 1));
    }
    f.close();
    recSaved = true;
    dashLog("[REC] Saved " + String(n) + " frames to SPIFFS");
    return true;
}

static bool dashStopRecordingAndSave(const char *reason = nullptr)
{
    if (!recActive && recSaved)
        return true;
    recActive = false;
    int n = recCount;
    bool ok = dashSaveRecordingToSpiffs(n);
    if (reason && *reason)
        dashLog(String("[REC] Stopped: ") + reason);
    return ok;
}

static void dashRecordCanFrame(const CanFrame &f, char dir)
{
    if (!recActive || !recBuf)
        return;
    int idx = recCount;
    if (idx >= REC_CAP)
        return;
    uint8_t dlc = (f.dlc <= 8) ? f.dlc : 8;
    recBuf[idx].ts = millis();
    recBuf[idx].dir = dir;
    recBuf[idx].id = f.id;
    recBuf[idx].dlc = dlc;
    memset(recBuf[idx].data, 0, sizeof(recBuf[idx].data));
    memcpy(recBuf[idx].data, f.data, dlc);
    recCount = idx + 1;
    if (recCount >= REC_CAP)
        dashStopRecordingAndSave("frame limit");
}

static bool dashWriteProbeMatches(const CanFrame &frame)
{
    if (!dashWriteProbe.active || dashWriteProbe.id != frame.id)
        return false;

    int8_t mux = dashFrameMux(frame);
    if (dashWriteProbe.mux < 0)
        return mux < 0;
    return mux == dashWriteProbe.mux;
}

static const char *decodeCanId(uint32_t id)
{
    switch (id)
    {
    case 0x045:
        return "STW_ACTN_RQ";
    case 0x129:
        return "Steering angle";
    case 0x175:
        return "Speed";
    case 0x186:
        return "Gear/Drive state";
    case 0x118:
        return "DI_systemStatus";
    case 0x233:
        return "UI_stalklessControl";
    case 0x257:
        return "State of charge";
    case 0x293:
        return "DAS control";
    case 0x321:
        return "Autopilot state";
    case 0x329:
        return "UI_autopilot";
    case 0x399:
        return "DAS_status";
    case 0x3E8:
        return "UI_driverAssistControl";
    case 0x3FD:
        return "UI_autopilotControl";
    case 0x678:
        return "GTW_gearControl";
    default:
        return "";
    }
}

