hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
static void sniffPush(const CanFrame &f)
{
    uint8_t dlc = (f.dlc <= 8) ? f.dlc : 8;
    sniffBuf[sniffHead] = {millis(), f.id, dlc, {}};
    memcpy(sniffBuf[sniffHead].data, f.data, dlc);
    sniffHead = (sniffHead + 1) % SNIFFER_CAP;
    if (sniffCount < SNIFFER_CAP)
        sniffCount++;
}

#define LOG_CAP 80
struct LogEntry
{
    String msg;
    unsigned long seq;
};
static LogEntry logBuf[LOG_CAP];
static int logHead = 0;
static int logCount = 0;
static unsigned long logSeq = 0;
// Cursor tracking how much of logRing we have copied into logBuf so far.
// logRing is filled by HW3/HW4 handlers when enablePrint is on (per-frame
// "AD: 1, Profile: 2, Offset: ..." diagnostics). We drain it here on demand
// so the WebUI /log endpoint surfaces those diagnostics in real time.
static uint32_t logRingDrainCursor = 0;

static void dashLog(const String &s)
{
    logBuf[logHead] = {String(millis() / 1000) + "s " + s, ++logSeq};
    logHead = (logHead + 1) % LOG_CAP;
    if (logCount < LOG_CAP)
        logCount++;
    Serial.println(s);
}

// Pull all new entries from the per-frame handler logRing (in handlers.h)
// into logBuf so /log returns them. Cheap: bounded by ring capacity (32).
static void dashDrainLogRing()
{
    uint32_t h = logRing.currentHead();
    if (h <= logRingDrainCursor)
    {
        logRingDrainCursor = h; // handle wrap / restart
        return;
    }
    LogRingBuffer::Entry tmp[LogRingBuffer::kCapacity];
    int n = logRing.readSince(logRingDrainCursor, tmp, LogRingBuffer::kCapacity);
    for (int i = 0; i < n; i++)
    {
        // Use the timestamp captured at push time, not now, so messages keep
        // their actual ordering. dashLog format prefixes seconds-since-boot.
        logBuf[logHead] = {String(tmp[i].timestamp_ms / 1000) + "s " + String(tmp[i].msg), ++logSeq};
        logHead = (logHead + 1) % LOG_CAP;
        if (logCount < LOG_CAP)
            logCount++;
    }
    logRingDrainCursor = h;
}

// Public hooks
static void mcpDashOnFrame(const CanFrame &f)
{
    unsigned long now = millis();
    rxCount++;
    lastFrameMs = now;
    canOnline = true;
    fpsFrames++;
    sniffPush(f);
    if (f.id == 1021 && f.dlc > 0)
    {
        uint8_t m = f.data[0] & 0x07;
        if (m < 4)
            muxRx[m]++;
    }
    if (f.id == 1016 && f.dlc > 5)
        followDist = (f.data[5] & 0xE0) >> 5;
    dashRecordCanFrame(f, 'R');
    if (dashWriteProbe.active && dashWriteProbe.state != kDashWriteProbeFailed && dashWriteProbeMatches(f))
    {
        dashWriteProbe.hasRx = true;
        dashWriteProbe.rxMs = now;
        dashWriteProbe.rxDlc = (f.dlc <= 8) ? f.dlc : 8;
        memset(dashWriteProbe.rxData, 0, sizeof(dashWriteProbe.rxData));
        memcpy(dashWriteProbe.rxData, f.data, dashWriteProbe.rxDlc);
        bool same = dashWriteProbe.txDlc == dashWriteProbe.rxDlc &&
                    memcmp(dashWriteProbe.txData, dashWriteProbe.rxData, dashWriteProbe.txDlc) == 0;
        dashWriteProbe.state = same ? kDashWriteProbeMatch : kDashWriteProbeDifferent;
    }
}

static void mcpDashOnTxFrame(const CanFrame &frame, bool ok)
{
    txCount++;
    int8_t mux = dashFrameMux(frame);
    if (!ok)
    {
        txErrCount++;
        if (mux >= 0 && mux < 4)
            muxErr[mux]++;
    }
    else if (mux >= 0 && mux < 4)
    {
        muxTx[mux]++;
    }
    if (ok)
        dashRecordCanFrame(frame, 'T');

    dashWriteProbe.active = true;
    dashWriteProbe.hasRx = false;
    dashWriteProbe.state = ok ? kDashWriteProbePending : kDashWriteProbeFailed;
    dashWriteProbe.id = frame.id;
    dashWriteProbe.mux = mux;
    dashWriteProbe.txMs = millis();
    dashWriteProbe.rxMs = 0;
    dashWriteProbe.txDlc = (frame.dlc <= 8) ? frame.dlc : 8;
    dashWriteProbe.rxDlc = 0;
    memset(dashWriteProbe.txData, 0, sizeof(dashWriteProbe.txData));
    memset(dashWriteProbe.rxData, 0, sizeof(dashWriteProbe.rxData));
    memcpy(dashWriteProbe.txData, frame.data, dashWriteProbe.txDlc);
}

// JSON escape for log strings
static String jsonEscape(const String &s)
{
    String out;
    out.reserve(s.length() + 8);
    for (unsigned int i = 0; i < s.length(); i++)
    {
        char c = s.charAt(i);
        if (c == '"')
            out += "\\\"";
        else if (c == '\\')
            out += "\\\\";
        else if (c == '\n')
            out += "\\n";
        else if (c == '\r')
            out += "\\r";
        else if (c < 0x20)
            out += ' ';
        else
            out += c;
    }
    return out;
}

static bool dashCheckADEnabled()
{
    return canActive;
}

static bool dashApInjectionAllowed()
{
    // 2.5.2 风格：apInjectionGate=false 时短路放行；=true 时回到 3.0 强制门控。
    return !apInjectionGate || (dashHandler && dashHandler->injectionGateOpen());
}

static bool dashInjectionActive()
{
    return canActive && dashApInjectionAllowed();
}

static void dashPostProcessFrame(const CanFrame &original, CanDriver &driver)
{
#if defined(DASH_FSD_252_COMPAT) && DASH_FSD_252_COMPAT
    if ((hwMode != 0 && hwMode != 1) || !dashInjectionActive())
        return;
    const uint32_t activationId = hwMode == 0 ? 1006 : 1021;
    if (original.id != activationId || original.dlc < 8 || readMuxID(original) != 0)
        return;

    CanFrame modified = original;
    if (dashHandler && !(bool)dashHandler->speedProfileAuto)
        setSpeedProfileV12V13(modified, (int)dashHandler->speedProfile);
    setBit(modified, 46, true);
    if (!framePayloadChanged(original, modified))
        return;

    if (dashHandler)
        dashHandler->framesSent++;
    bool ok = driver.send(modified);
    if (ok)
        lastInjectMs = millis();
    if (dashHandler && dashHandler->onSend)
        dashHandler->onSend(0, ok);
#else
    (void)original;
    (void)driver;
#endif
}

static bool dashCheckNagDisabled()
{
    return false;
}

static bool dashStaSsidLooksCorrupt(const String &ssid)
{
    return ssid.indexOf("\"ssid\"") >= 0 || ssid.indexOf("{\"") >= 0 ||
           ssid.indexOf("\",\"") >= 0;
}

// dashClampHw3SlewRate / dashLoadHw3SlewRate now in dash_hw3_speed.h.

static uint8_t dashClampSpeedProfileForHw(uint8_t hw, int profile)
{
    int maxProfile = hw == 2 ? 4 : 2;
    if (profile < 0)
        return 0;
    if (profile > maxProfile)
        return static_cast<uint8_t>(maxProfile);
    return static_cast<uint8_t>(profile);
}

static void dashApplySpeedProfileState()
{
    if (!dashHandler)
        return;
    dashHandler->speedProfileAuto = dashSpeedProfileAuto;
    if (!dashSpeedProfileAuto)
        dashHandler->speedProfile = dashClampSpeedProfileForHw(hwMode, dashManualSpeedProfile);
}

// HW3 mux-2 codec + slew limiter live in include/dash_hw3_speed.h so they
// can be shared between HW3Handler (in handlers.h, parsed first) and the
// dashboard HW3 send path below.

static void dashApplyRuntimeState()
{
    forceActivateRuntime = canActive && forceActivate;
    emergencyVehicleDetectionRuntime = false;
    isaSpeedChimeSuppressRuntime = false;
    enhancedAutopilotRuntime = false;
    nagKillerRuntime = false;

    if (dashHandler)
    {
        dashHandler->checkAD = dashCheckADEnabled;
        dashHandler->checkNag = dashCheckNagDisabled;
        dashApplySpeedProfileState();
        if (!canActive)
        {
            dashHandler->ADEnabled = false;
            dashHandler->APActive = false;
        }
    }

#if defined(DASH_RGB_STATUS_LED)
    appRefreshStatusLed();
#endif
}

