hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
// Store config
static void dashSavePrefs()
{
    prefs.begin(PREFS_NS, false);
    prefs.putUChar("hw", hwMode);
    prefs.putUChar("hw_def", DASH_DEFAULT_HW);
    prefs.putBool("can", canActive);
    prefs.putBool("force_act", forceActivate);
    prefs.putBool("ap_gate", apInjectionGate);
    prefs.putBool("sp_auto", dashSpeedProfileAuto);
    prefs.putUChar("sp_sel", dashManualSpeedProfile);
    prefs.putBool("eprn", dashHandler ? (bool)dashHandler->enablePrint : true);
    prefs.putBool("h3_slw", hw3OffsetSlew);
    prefs.putUChar("h3_srt", hw3SlewRate);
    // HW3 custom speed-limit boost
    prefs.putBool("h3_cust", hw3CustomSpeed);
    prefs.putBool("h3_hse", hw3HighSpeedEnable);
    prefs.putUChar("h3_enc", hw3WireEncoding);
    char k[8];
    for (uint8_t i = 0; i < kHw3CustomTargetCount; i++)
    {
        snprintf(k, sizeof(k), "h3_ct%u", (unsigned)i);
        prefs.putUChar(k, hw3CustomTarget[i]);
    }
    for (uint8_t i = 0; i < kHw3HighSpeedBucketCount; i++)
    {
        snprintf(k, sizeof(k), "h3_ht%u", (unsigned)i);
        prefs.putUChar(k, hw3HighSpeedTarget[i]);
    }
    // Legacy MPP custom speed-limit override
    prefs.putBool("lg_mpp_en", legacyMppOverride);
    prefs.putBool("lg_mppc_en", legacyMppCustomEnable);
    prefs.putBool("lg_mpph_en", legacyMppHighSpeedEnable);
    for (uint8_t i = 0; i < kLegacyMppCustomTargetCount; i++)
    {
        snprintf(k, sizeof(k), "lg_ct%u", (unsigned)i);
        prefs.putUChar(k, legacyMppCustomTarget[i]);
    }
    for (uint8_t i = 0; i < kLegacyMppHighSpeedBucketCount; i++)
    {
        snprintf(k, sizeof(k), "lg_ht%u", (unsigned)i);
        prefs.putUChar(k, legacyMppHighSpeedTarget[i]);
    }
    prefs.end();
}

static void dashSetCanActive(bool active, const char *reason = nullptr)
{
    bool changed = (canActive != active) || (forceActivate != active);
    canActive = active;
    forceActivate = active;
    dashApplyRuntimeState();
    dashSavePrefs();
    if (changed)
    {
        String msg = String("[CFG] FSD master switch ") + (active ? "ON" : "OFF");
        if (reason && *reason)
            msg += String(" via ") + reason;
        dashLog(msg);
    }
}

[[maybe_unused]] static void dashToggleCanActive(const char *reason = nullptr)
{
    dashSetCanActive(!canActive, reason);
}

static bool dashApPasswordLengthValid(size_t len)
{
    return len >= kDashMinApPassLen && len <= kDashMaxPassLen;
}

static bool dashApConfigValid(const char *ssid, const char *pass)
{
    size_t ssidLen = strlen(ssid);
    size_t passLen = strlen(pass);
    return ssidLen > 0 && ssidLen <= kDashMaxSsidLen && dashApPasswordLengthValid(passLen);
}

static void dashUseDefaultApConfig()
{
    strlcpy(apSSID, DASH_SSID, sizeof(apSSID));
    strlcpy(apPass, DASH_PASS, sizeof(apPass));
    apHidden = false;
}

static bool dashStaConfigLengthValid(const String &ssid, const String &pass)
{
    return ssid.length() <= kDashMaxSsidLen && pass.length() <= kDashMaxPassLen;
}

static void dashClearLegacyOptionPrefs()
{
    static const char *const keys[] = {
        "fAD",
        "f_AD",
        "f_nag",
        "f_sum",
        "f_isa",
        "f_evd",
        "f_h4o",
        "sp",
        "sp_lock",
    };

    bool removed = false;
    for (const char *key : keys)
    {
        if (!prefs.isKey(key))
            continue;
        prefs.remove(key);
        removed = true;
    }

    if (removed)
        dashLog("[BOOT] Cleared legacy dashboard prefs from NVS");
}

static void dashLoadPrefs()
{
    prefs.begin(PREFS_NS, false);
    dashClearLegacyOptionPrefs();
    bool hasStoredHw = prefs.isKey("hw");
    uint8_t storedHw = prefs.getUChar("hw", DASH_DEFAULT_HW);
    uint8_t storedDefaultHw = prefs.getUChar("hw_def", kDashUnsetU8);
    bool migratedHw = false;

    hwMode = storedHw <= 2 ? storedHw : DASH_DEFAULT_HW;
    if (!hasStoredHw || storedHw > 2)
        migratedHw = true;

    // If the stored selection only mirrors the old firmware default, follow the
    // new build default after reflashing instead of staying pinned to stale NVS.
    if (storedDefaultHw <= 2 && storedDefaultHw != DASH_DEFAULT_HW && hwMode == storedDefaultHw)
    {
        hwMode = DASH_DEFAULT_HW;
        migratedHw = true;
    }

    if (migratedHw)
        prefs.putUChar("hw", hwMode);
    if (storedDefaultHw != DASH_DEFAULT_HW)
        prefs.putUChar("hw_def", DASH_DEFAULT_HW);
    canActive = prefs.getBool("can", kDashInjectionDefaultEnabled);
    forceActivate = canActive;
    if (prefs.getBool("force_act", canActive) != forceActivate)
        prefs.putBool("force_act", forceActivate);
    // 默认 false：复刻 2.5.2 真车固件行为（apInjectionGate=false 注入无条件放行）。
    apInjectionGate = prefs.getBool("ap_gate", false);
    dashSpeedProfileAuto = prefs.getBool("sp_auto", true);
    dashManualSpeedProfile = dashClampSpeedProfileForHw(hwMode, prefs.getUChar("sp_sel", 1));
    hw3OffsetSlew = prefs.getBool("h3_slw", false);
    hw3SlewRate = dashLoadHw3SlewRate(prefs.getUChar("h3_srt", kHw3SlewRateDefault));
    // HW3 custom speed-limit boost
    hw3CustomSpeed = prefs.getBool("h3_cust", false);
    hw3HighSpeedEnable = prefs.getBool("h3_hse", false);
    {
        uint8_t enc = prefs.getUChar("h3_enc", kHw3WireEncDefault);
        hw3WireEncoding = (enc == kHw3WireEncKph5) ? kHw3WireEncKph5 : kHw3WireEncPct4;
    }
    {
        char k[8];
        static const uint8_t defCt[kHw3CustomTargetCount] = {45, 60, 75, 90, 105};
        static const uint8_t defHs[kHw3HighSpeedBucketCount] = {90, 110, 130};
        for (uint8_t i = 0; i < kHw3CustomTargetCount; i++)
        {
            snprintf(k, sizeof(k), "h3_ct%u", (unsigned)i);
            hw3CustomTarget[i] = dashClampHw3CustomTargetForBucket(i, prefs.getUChar(k, defCt[i]));
        }
        for (uint8_t i = 0; i < kHw3HighSpeedBucketCount; i++)
        {
            snprintf(k, sizeof(k), "h3_ht%u", (unsigned)i);
            hw3HighSpeedTarget[i] = dashClampHw3HighSpeedTargetForBucket(i,
                prefs.getUChar(k, defHs[i]));
        }
    }
    // Legacy MPP custom speed-limit override
    legacyMppOverride = prefs.getBool("lg_mpp_en", false);
    legacyMppCustomEnable = prefs.getBool("lg_mppc_en", false);
    legacyMppHighSpeedEnable = prefs.getBool("lg_mpph_en", false);
    {
        char k[8];
        static const uint8_t defLgCt[kLegacyMppCustomTargetCount] = {45, 60, 75, 90, 105};
        static const uint8_t defLgHt[kLegacyMppHighSpeedBucketCount] = {90, 110, 130};
        for (uint8_t i = 0; i < kLegacyMppCustomTargetCount; i++)
        {
            snprintf(k, sizeof(k), "lg_ct%u", (unsigned)i);
            legacyMppCustomTarget[i] = dashClampLegacyMppCustomTargetForBucket(i, prefs.getUChar(k, defLgCt[i]));
        }
        for (uint8_t i = 0; i < kLegacyMppHighSpeedBucketCount; i++)
        {
            snprintf(k, sizeof(k), "lg_ht%u", (unsigned)i);
            legacyMppHighSpeedTarget[i] = dashClampLegacyMppHighSpeedTargetForBucket(i, prefs.getUChar(k, defLgHt[i]));
        }
    }
    bool ep = prefs.getBool("eprn", true);

    dashApplyRuntimeState();
    if (dashHandler)
        dashHandler->enablePrint = ep;
    // Load WiFi AP overrides (hotspot name/password)
    String apSsidPref = prefs.isKey("ap_ssid") ? prefs.getString("ap_ssid", "") : "";
    String apPassPref = prefs.isKey("ap_pass") ? prefs.getString("ap_pass", "") : "";
    bool hasApOverride = apSsidPref.length() > 0 || apPassPref.length() > 0 || prefs.isKey("ap_hidden");
    bool invalidApOverride = apSsidPref.length() > kDashMaxSsidLen ||
                             (apPassPref.length() > 0 && !dashApPasswordLengthValid(apPassPref.length()));
    if (apSsidPref.length() > 0)
        strlcpy(apSSID, apSsidPref.c_str(), sizeof(apSSID));
    else
        strlcpy(apSSID, DASH_SSID, sizeof(apSSID));
    if (apPassPref.length() > 0)
        strlcpy(apPass, apPassPref.c_str(), sizeof(apPass));
    else
        strlcpy(apPass, DASH_PASS, sizeof(apPass));
    apHidden = prefs.getBool("ap_hidden", false);
    if (invalidApOverride || !dashApConfigValid(apSSID, apPass))
    {
        if (hasApOverride)
        {
            prefs.remove("ap_ssid");
            prefs.remove("ap_pass");
            prefs.remove("ap_hidden");
            dashLog("[WIFI] Invalid saved AP config ignored");
        }
        dashUseDefaultApConfig();
    }

    // Load WiFi STA networks (multi-SSID slot array)
    wifiNetworkCount = 0;
    for (uint8_t i = 0; i < kDashMaxWifiNetworks; i++)
        dashClearWifiNetwork(wifiNetworks[i]);

    uint8_t storedCount = prefs.getUChar("wn_cnt", 0);
    if (storedCount > kDashMaxWifiNetworks)
        storedCount = kDashMaxWifiNetworks;

