hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
    bool APActive = dashHandler ? (bool)dashHandler->APActive : false;
    bool ADEnabled = dashHandler ? (bool)dashHandler->ADEnabled : false;
    int sp = dashHandler ? (int)dashHandler->speedProfile : 0;
    bool spAuto = dashHandler ? (bool)dashHandler->speedProfileAuto : true;
    int soff = dashHandler ? (int)dashHandler->speedOffset : 0;
    int gtwAp = dashHandler ? (int)dashHandler->gatewayAutopilot : -1;
    bool ep = dashHandler ? (bool)dashHandler->enablePrint : true;
    bool apGateOpen = dashApInjectionAllowed();

    String j = "{\"hw\":";
    j += hwMode;
    j += ",\"sp\":";
    j += sp;
    j += ",\"spAuto\":";
    j += spAuto ? "true" : "false";
    j += ",\"soff\":";
    j += soff;
    j += ",\"gtwap\":";
    j += gtwAp;
    j += ",\"AD\":";
    j += APActive ? "true" : "false";
    j += ",\"apActive\":";
    j += APActive ? "true" : "false";
    j += ",\"adEnabled\":";
    j += ADEnabled ? "true" : "false";
    j += ",\"eprn\":";
    j += ep ? "true" : "false";
    j += ",\"force\":";
    j += forceActivate ? "true" : "false";
    j += ",\"apGate\":";
    j += (canActive && !apGateOpen) ? "true" : "false";
    j += ",\"apGateOpen\":";
    j += apGateOpen ? "true" : "false";
    j += ",\"apGateEnabled\":";
    j += apInjectionGate ? "true" : "false";
    j += ",\"ia\":";
    j += dashInjectionActive() ? "true" : "false";
    j += ",\"lastInjectMs\":";
    j += (uint32_t)lastInjectMs;
    j += ",\"hw3OffsetSlew\":";
    j += hw3OffsetSlew ? "true" : "false";
    j += ",\"hw3SlewRate\":";
    j += hw3SlewRate;
    j += ",\"hw3OffsetTarget\":";
    j += hw3OffsetTargetRaw;
    j += ",\"hw3OffsetLast\":";
    j += hw3OffsetLastRaw;
    j += ",\"hw3SlewCount\":";
    j += hw3OffsetSlewCount;
    // HW3 custom speed-limit boost
    j += ",\"hw3CustomSpeed\":";
    j += hw3CustomSpeed ? "true" : "false";
    j += ",\"hw3CustomTarget\":[";
    for (uint8_t i = 0; i < kHw3CustomTargetCount; i++)
    {
        if (i) j += ",";
        j += hw3CustomTarget[i];
    }
    j += "],\"hw3HighSpeedEnable\":";
    j += hw3HighSpeedEnable ? "true" : "false";
    j += ",\"hw3HighSpeedTarget\":[";
    for (uint8_t i = 0; i < kHw3HighSpeedBucketCount; i++)
    {
        if (i) j += ",";
        j += hw3HighSpeedTarget[i];
    }
    j += "],\"hw3WireEncoding\":";
    j += hw3WireEncoding;
    j += ",\"fusedSpeedLimitRaw\":";
    j += fusedSpeedLimitRaw;
    j += ",\"fusedSpeedLimitKph\":";
    j += (fusedSpeedLimitRaw == 0 || fusedSpeedLimitRaw == 31)
             ? 0
             : (uint16_t)fusedSpeedLimitRaw * 5;
    j += ",\"hw3StockOffset\":";
    j += hw3StockOffsetKph;
    // Legacy MPP custom speed-limit override
    j += ",\"legacyMppOverride\":";
    j += legacyMppOverride ? "true" : "false";
    j += ",\"legacyMppCustomEnable\":";
    j += legacyMppCustomEnable ? "true" : "false";
    j += ",\"legacyMppCustomTarget\":[";
    for (uint8_t i = 0; i < kLegacyMppCustomTargetCount; i++)
    {
        if (i) j += ",";
        j += legacyMppCustomTarget[i];
    }
    j += "],\"legacyMppHighSpeedEnable\":";
    j += legacyMppHighSpeedEnable ? "true" : "false";
    j += ",\"legacyMppHighSpeedTarget\":[";
    for (uint8_t i = 0; i < kLegacyMppHighSpeedBucketCount; i++)
    {
        if (i) j += ",";
        j += legacyMppHighSpeedTarget[i];
    }
    j += "],\"legacyMppLastRaw\":";
    j += legacyMppLastRaw;
    j += ",\"legacyMppLastSentRaw\":";
    j += legacyMppLastSentRaw;
    j += ",\"can\":";
    j += canOnline ? "true" : "false";
    j += ",\"ci\":";
    j += canActive ? "true" : "false";
    j += ",\"rx\":";
    j += rxCount;
    j += ",\"tx\":";
    j += txCount;
    j += ",\"txerr\":";
    j += txErrCount;
    j += ",\"fd\":";
    j += followDist;
    j += ",\"fps\":";
    {
        unsigned long fpsX10 = static_cast<unsigned long>(fps * 10.0f + 0.5f);
        j += String(fpsX10 / 10);
        j += ".";
        j += String(fpsX10 % 10);
    }
    j += ",\"eflg\":";
    j += mcpEflg;
    j += ",\"up\":";
    j += (millis() - startMs) / 1000;
    j += ",\"probe\":{\"active\":";
    j += dashWriteProbe.active ? "true" : "false";
    j += ",\"state\":";
    j += dashWriteProbe.state;
    j += ",\"id\":";
    j += dashWriteProbe.id;
    j += ",\"mux\":";
    j += dashWriteProbe.mux;
    j += ",\"txa\":";
    j += dashWriteProbe.active ? String(now - dashWriteProbe.txMs) : String(0);
    j += ",\"rxa\":";
    j += dashWriteProbe.hasRx ? String(now - dashWriteProbe.rxMs) : String(0);
    j += ",\"txdlc\":";
    j += dashWriteProbe.txDlc;
    j += ",\"rxdlc\":";
    j += dashWriteProbe.rxDlc;
    j += ",\"hasrx\":";
    j += dashWriteProbe.hasRx ? "true" : "false";
    j += ",\"tx\":[";
    for (uint8_t i = 0; i < dashWriteProbe.txDlc; i++)
    {
        if (i)
            j += ",";
        j += String(dashWriteProbe.txData[i]);
    }
    j += "],\"rx\":[";
    for (uint8_t i = 0; i < dashWriteProbe.rxDlc; i++)
    {
        if (i)
            j += ",";
        j += String(dashWriteProbe.rxData[i]);
    }
    j += "]},\"mux\":[";
    for (int i = 0; i < 3; i++)
    {
        if (i)
            j += ",";
        j += "{\"rx\":" + String(muxRx[i]) +
             ",\"tx\":" + String(muxTx[i]) +
             ",\"err\":" + String(muxErr[i]) + "}";
    }
    j += "]}";
    server.send(200, "application/json", j);
}

static void handleConfig()
{
    bool hwChanged = false;
    if (server.hasArg("hw"))
    {
        uint8_t v = server.arg("hw").toInt();
        if (v <= 2 && v != hwMode)
        {
            hwMode = v;
            hwChanged = true;
            dashLog("[CFG] HW=" + String(v == 0 ? "LEGACY" : v == 1 ? "HW3"
                                                                    : "HW4"));
        }
    }
    bool requestedFsdSwitch = canActive;
    bool hasFsdSwitchArg = false;
    if (server.hasArg("can"))
    {
        requestedFsdSwitch = server.arg("can") == "1";
        hasFsdSwitchArg = true;
    }
    if (server.hasArg("force"))
    {
        requestedFsdSwitch = server.arg("force") == "1";
        hasFsdSwitchArg = true;
    }
    if (hasFsdSwitchArg && ((requestedFsdSwitch != canActive) || (requestedFsdSwitch != forceActivate)))
    {
        canActive = requestedFsdSwitch;
        forceActivate = requestedFsdSwitch;
        dashLog("[CFG] FSD master switch " + String(requestedFsdSwitch ? "ON" : "OFF"));
    }
    bool profileAutoRequested = server.hasArg("spa") && server.arg("spa") == "1";
    if (server.hasArg("sp"))
    {
        uint8_t v = dashClampSpeedProfileForHw(hwMode, server.arg("sp").toInt());
        if (!profileAutoRequested && (v != dashManualSpeedProfile || dashSpeedProfileAuto))
            dashLog("[CFG] Speed profile manual " + String(v));
        dashManualSpeedProfile = v;
        if (!profileAutoRequested)
            dashSpeedProfileAuto = false;
    }
    if (server.hasArg("spa"))
    {
        bool v = server.arg("spa") == "1";
        if (v != dashSpeedProfileAuto)
            dashLog("[CFG] Speed profile " + String(v ? "AUTO" : "MANUAL"));
        dashSpeedProfileAuto = v;
    }
    if (server.hasArg("hw3OffsetSlew"))
    {
        bool v = server.arg("hw3OffsetSlew") == "1";
        if (v != hw3OffsetSlew)
        {
            hw3OffsetSlew = v;
            dashLog("[CFG] HW3 offset slew " + String(v ? "ON" : "OFF"));
        }
    }
    if (server.hasArg("hw3SlewRate"))
    {
        uint8_t v = dashClampHw3SlewRate(server.arg("hw3SlewRate").toInt());
        if (v != hw3SlewRate)
        {
            hw3SlewRate = v;
            dashLog("[CFG] HW3 slew rate " + String(hw3SlewRate) + "%/s");
        }
    }
    // ─── HW3 custom speed-limit boost ────────────────────────────────────────
    if (server.hasArg("hw3CustomSpeed"))
    {
        bool v = server.arg("hw3CustomSpeed") == "1";
        if (v != hw3CustomSpeed)
        {
            hw3CustomSpeed = v;
            dashLog("[CFG] HW3 custom speed " + String(v ? "ON" : "OFF"));
        }
    }
    if (server.hasArg("hw3HighSpeedEnable"))
    {
        bool v = server.arg("hw3HighSpeedEnable") == "1";
        if (v != hw3HighSpeedEnable)
        {
            hw3HighSpeedEnable = v;
            dashLog("[CFG] HW3 high-speed " + String(v ? "ON" : "OFF"));
        }
    }
    if (server.hasArg("hw3WireEncoding"))
    {
        int v = server.arg("hw3WireEncoding").toInt();
        uint8_t enc = (v == kHw3WireEncKph5) ? kHw3WireEncKph5 : kHw3WireEncPct4;
        if (enc != hw3WireEncoding)
        {
            hw3WireEncoding = enc;
            dashLog(String("[CFG] HW3 wire enc ") +
                    (enc == kHw3WireEncPct4 ? "PCT4" : "KPH5"));
        }
    }
    {
        char arg[16];
        for (uint8_t i = 0; i < kHw3CustomTargetCount; i++)
        {
            snprintf(arg, sizeof(arg), "hw3CustomT%u", (unsigned)i);
            if (server.hasArg(arg))
                hw3CustomTarget[i] = dashClampHw3CustomTargetForBucket(i,
                    server.arg(arg).toInt());
        }
        for (uint8_t i = 0; i < kHw3HighSpeedBucketCount; i++)
        {
            snprintf(arg, sizeof(arg), "hw3HighTarget%u", (unsigned)i);
            if (server.hasArg(arg))
                hw3HighSpeedTarget[i] = dashClampHw3HighSpeedTargetForBucket(i,
                    server.arg(arg).toInt());
        }
    }
    // ─── Legacy MPP custom speed-limit override ──────────────────────────────
    if (server.hasArg("legacyMppOverride"))
    {
        bool v = server.arg("legacyMppOverride") == "1";
        if (v != legacyMppOverride)
        {
            legacyMppOverride = v;
            dashLog("[CFG] Legacy MPP override " + String(v ? "ON" : "OFF"));
        }
    }
    if (server.hasArg("legacyMppCustomEnable"))
    {
        bool v = server.arg("legacyMppCustomEnable") == "1";
        if (v != legacyMppCustomEnable)
        {
            legacyMppCustomEnable = v;
            dashLog("[CFG] Legacy MPP custom " + String(v ? "ON" : "OFF"));
        }
    }
    if (server.hasArg("legacyMppHighSpeedEnable"))
    {
        bool v = server.arg("legacyMppHighSpeedEnable") == "1";
        if (v != legacyMppHighSpeedEnable)
        {
            legacyMppHighSpeedEnable = v;
            dashLog("[CFG] Legacy MPP high-speed " + String(v ? "ON" : "OFF"));
        }
    }
    {
        char arg[28];
        for (uint8_t i = 0; i < kLegacyMppCustomTargetCount; i++)
        {
            snprintf(arg, sizeof(arg), "legacyMppCustomT%u", (unsigned)i);
            if (server.hasArg(arg))
                legacyMppCustomTarget[i] = dashClampLegacyMppCustomTargetForBucket(i,
                    server.arg(arg).toInt());
        }
        for (uint8_t i = 0; i < kLegacyMppHighSpeedBucketCount; i++)
        {
            snprintf(arg, sizeof(arg), "legacyMppHighTarget%u", (unsigned)i);
            if (server.hasArg(arg))
                legacyMppHighSpeedTarget[i] = dashClampLegacyMppHighSpeedTargetForBucket(i,
                    server.arg(arg).toInt());
        }
    }
    if (hwChanged)
    {
        dashSwapHandler(hwMode);
        dashApplyFilters();
    }
    dashApplyRuntimeState();
    dashSavePrefs();
    server.send(200, "application/json", "{\"ok\":true}");
}

