hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
// ── AP Config (hotspot name/password) ───────────────────────────

#ifdef ESP_PLATFORM
static const char *dashResetReasonName(esp_reset_reason_t reason)
{
    switch (reason)
    {
    case ESP_RST_POWERON:
        return "poweron";
    case ESP_RST_EXT:
        return "external";
    case ESP_RST_SW:
        return "software";
    case ESP_RST_PANIC:
        return "panic";
    case ESP_RST_INT_WDT:
        return "interrupt_wdt";
    case ESP_RST_TASK_WDT:
        return "task_wdt";
    case ESP_RST_WDT:
        return "other_wdt";
    case ESP_RST_DEEPSLEEP:
        return "deepsleep";
    case ESP_RST_BROWNOUT:
        return "brownout";
    case ESP_RST_SDIO:
        return "sdio";
    default:
        return "unknown";
    }
}

static bool dashReadTemperature(float &celsius)
{
    static temperature_sensor_handle_t tempHandle = nullptr;
    static bool tempReady = false;
    static bool tempTried = false;
    if (!tempTried)
    {
        tempTried = true;
        temperature_sensor_config_t cfg = TEMPERATURE_SENSOR_CONFIG_DEFAULT(-10, 80);
        if (temperature_sensor_install(&cfg, &tempHandle) == ESP_OK &&
            temperature_sensor_enable(tempHandle) == ESP_OK)
        {
            tempReady = true;
        }
    }
    return tempReady && temperature_sensor_get_celsius(tempHandle, &celsius) == ESP_OK;
}
#endif

#if defined(ESP_PLATFORM) && CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS
static void dashReadCpuLoad(uint8_t &core0Load, uint8_t &core1Load, bool &valid)
{
    static uint32_t prevIdle[2] = {0, 0};
    static int64_t prevWallUs = 0;
    static bool havePrev = false;

    core0Load = 0;
    core1Load = 0;
    valid = false;

    constexpr UBaseType_t kMaxTasksForCpuStats = 48;
    TaskStatus_t tasks[kMaxTasksForCpuStats];
    configRUN_TIME_COUNTER_TYPE totalRunTime = 0;
    UBaseType_t count = uxTaskGetSystemState(tasks, kMaxTasksForCpuStats, &totalRunTime);
    if (count == 0)
        return;

    uint32_t idle[2] = {0, 0};
    bool seenIdle[2] = {false, false};
    for (UBaseType_t i = 0; i < count; i++)
    {
        const char *name = tasks[i].pcTaskName ? tasks[i].pcTaskName : "";
        if (strncmp(name, "IDLE", 4) != 0)
            continue;
        BaseType_t core = -1;
        size_t len = strlen(name);
        if (len > 0 && name[len - 1] >= '0' && name[len - 1] <= '1')
            core = name[len - 1] - '0';
        if (core >= 0 && core <= 1)
        {
            idle[core] = static_cast<uint32_t>(tasks[i].ulRunTimeCounter);
            seenIdle[core] = true;
        }
    }
    if (!seenIdle[0] || !seenIdle[1])
        return;

    int64_t nowUs = esp_timer_get_time();
    if (!havePrev)
    {
        prevIdle[0] = idle[0];
        prevIdle[1] = idle[1];
        prevWallUs = nowUs;
        havePrev = true;
        return;
    }

    uint32_t wallDelta = static_cast<uint32_t>(nowUs - prevWallUs);
    if (wallDelta < 100000)
        return;

    uint32_t idleDelta0 = idle[0] - prevIdle[0];
    uint32_t idleDelta1 = idle[1] - prevIdle[1];
    auto loadFromIdle = [](uint32_t idleDelta, uint32_t elapsedUs) -> uint8_t {
        uint32_t idlePct = elapsedUs ? (idleDelta * 100UL + elapsedUs / 2) / elapsedUs : 0;
        if (idlePct > 100)
            idlePct = 100;
        return static_cast<uint8_t>(100 - idlePct);
    };

    core0Load = loadFromIdle(idleDelta0, wallDelta);
    core1Load = loadFromIdle(idleDelta1, wallDelta);
    valid = true;
    prevIdle[0] = idle[0];
    prevIdle[1] = idle[1];
    prevWallUs = nowUs;
}
#else
static void dashReadCpuLoad(uint8_t &core0Load, uint8_t &core1Load, bool &valid)
{
    core0Load = 0;
    core1Load = 0;
    valid = false;
}
#endif

static void handleSystemStatus()
{
#ifdef ESP_PLATFORM
    esp_chip_info_t chip;
    esp_chip_info(&chip);

    uint32_t flashSize = 0;
    esp_flash_get_size(NULL, &flashSize);

    uint8_t mac[6] = {0};
    esp_read_mac(mac, ESP_MAC_WIFI_STA);
    char macText[18];
    snprintf(macText, sizeof(macText), "%02X:%02X:%02X:%02X:%02X:%02X",
             mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

    wifi_ap_record_t apInfo;
    int rssi = 0;
    bool hasRssi = esp_wifi_sta_get_ap_info(&apInfo) == ESP_OK;
    if (hasRssi)
        rssi = apInfo.rssi;

    size_t spiffsTotal = 0, spiffsUsed = 0;
    bool spiffsOk = esp_spiffs_info(NULL, &spiffsTotal, &spiffsUsed) == ESP_OK;

    const esp_partition_t *running = esp_ota_get_running_partition();
    uint32_t appUsed = 0;
    if (running)
    {
        esp_partition_pos_t runningPos = {};
        runningPos.offset = running->address;
        runningPos.size = running->size;
        esp_image_metadata_t imageMeta = {};
        if (esp_image_get_metadata(&runningPos, &imageMeta) == ESP_OK)
            appUsed = imageMeta.image_len;
    }
    float tempC = 0.0f;
    bool hasTemp = dashReadTemperature(tempC);
    uint32_t cpuHz = static_cast<uint32_t>(esp_clk_cpu_freq());
    uint32_t cpuMhz = (cpuHz + 500000UL) / 1000000UL;
    uint32_t apbMhz = (static_cast<uint32_t>(esp_clk_apb_freq()) + 500000UL) / 1000000UL;
    uint32_t xtalMhz = (static_cast<uint32_t>(esp_clk_xtal_freq()) + 500000UL) / 1000000UL;
    bool pmDynamic = false;
    int pmMinMhz = CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ;
    int pmMaxMhz = CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ;
#if CONFIG_PM_ENABLE
    esp_pm_config_t pmConfig;
    if (esp_pm_get_configuration(&pmConfig) == ESP_OK)
    {
        pmDynamic = pmConfig.min_freq_mhz != pmConfig.max_freq_mhz;
        pmMinMhz = pmConfig.min_freq_mhz;
        pmMaxMhz = pmConfig.max_freq_mhz;
    }
#endif
    wifi_mode_t wifiMode = WIFI_MODE_NULL;
    esp_wifi_get_mode(&wifiMode);
    wifi_ps_type_t wifiPs = WIFI_PS_NONE;
    esp_wifi_get_ps(&wifiPs);
    const char *wifiModeText = "off";
    switch (wifiMode)
    {
    case WIFI_MODE_STA:
        wifiModeText = "STA";
        break;
    case WIFI_MODE_AP:
        wifiModeText = "AP";
        break;
    case WIFI_MODE_APSTA:
        wifiModeText = "AP+STA";
        break;
    default:
        wifiModeText = "off";
        break;
    }
    uint8_t cpu0Load = 0, cpu1Load = 0;
    bool hasCpuLoad = false;
    dashReadCpuLoad(cpu0Load, cpu1Load, hasCpuLoad);

    String j = "{\"chip\":\"ESP32-S3\"";
    j += ",\"module\":\"ESP32-S3R8\"";
    j += ",\"target\":\"" CONFIG_IDF_TARGET "\"";
    j += ",\"cores\":" + String(chip.cores);
    j += ",\"revision\":" + String(chip.revision);
    j += ",\"cpu_mhz\":" + String(cpuMhz);
    j += ",\"cpu_default_mhz\":" + String(CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ);
    j += ",\"cpu_max_mhz\":240";
    j += ",\"cpu_core0_mhz\":" + String(cpuMhz);
    j += ",\"cpu_core1_mhz\":" + String(chip.cores > 1 ? cpuMhz : 0);
    j += ",\"cpu_policy\":\"" + String(pmDynamic ? "dynamic" : "fixed") + "\"";
    j += ",\"cpu_pm_min_mhz\":" + String(pmMinMhz);
    j += ",\"cpu_pm_max_mhz\":" + String(pmMaxMhz);
    j += ",\"cpu_overclock\":" + String(cpuMhz > 240 ? "true" : "false");
    j += ",\"cpu_load_valid\":" + String(hasCpuLoad ? "true" : "false");
    j += ",\"cpu0_load\":" + String(cpu0Load);
    j += ",\"cpu1_load\":" + String(cpu1Load);
    j += ",\"apb_mhz\":" + String(apbMhz);
    j += ",\"xtal_mhz\":" + String(xtalMhz);
    j += ",\"sram_bytes\":524288";
    j += ",\"rtc_sram_bytes\":16384";
    j += ",\"rom_bytes\":393216";
    j += ",\"idf\":\"" IDF_VER "\"";
    j += ",\"firmware\":\"" FIRMWARE_VERSION "\"";
    j += ",\"mac\":\"" + String(macText) + "\"";
    j += ",\"reset\":\"" + String(dashResetReasonName(esp_reset_reason())) + "\"";
    j += ",\"uptime\":" + String((millis() - startMs) / 1000);
    j += ",\"tasks\":" + String(uxTaskGetNumberOfTasks());
    j += ",\"core\":" + String(xPortGetCoreID());
    j += ",\"heap_total\":" + String(heap_caps_get_total_size(MALLOC_CAP_8BIT));
    j += ",\"heap_free\":" + String(heap_caps_get_free_size(MALLOC_CAP_8BIT));
    j += ",\"heap_min\":" + String(heap_caps_get_minimum_free_size(MALLOC_CAP_8BIT));
    j += ",\"heap_largest\":" + String(heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));
    j += ",\"internal_free\":" + String(heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
    j += ",\"psram_total\":" + String(heap_caps_get_total_size(MALLOC_CAP_SPIRAM));
    j += ",\"psram_free\":" + String(heap_caps_get_free_size(MALLOC_CAP_SPIRAM));
    j += ",\"flash_size\":" + String(flashSize);
    j += ",\"flash_speed\":" + String(80000000UL);
    j += ",\"app_addr\":" + String(running ? running->address : 0);
    j += ",\"app_size\":" + String(running ? running->size : 0);
    j += ",\"app_used\":" + String(appUsed);
    j += ",\"app_label\":\"" + String(running ? running->label : "") + "\"";
    j += ",\"spiffs_ok\":" + String(spiffsOk ? "true" : "false");
    j += ",\"spiffs_total\":" + String(spiffsTotal);
    j += ",\"spiffs_used\":" + String(spiffsUsed);
    j += ",\"wifi_connected\":" + String(WiFi.status() == WL_CONNECTED ? "true" : "false");
    j += ",\"wifi_mode\":\"" + String(wifiModeText) + "\"";
    j += ",\"wifi_sleep\":" + String(wifiPs == WIFI_PS_NONE ? "false" : "true");
    j += ",\"wifi_standard\":\"2.4GHz 802.11 b/g/n\"";
    j += ",\"wifi_max_mbps\":150";
    j += ",\"ble_supported\":" + String((chip.features & CHIP_FEATURE_BLE) ? "true" : "false");
#ifdef CONFIG_BT_ENABLED
    j += ",\"ble_enabled\":true";
    j += ",\"ble_status\":\"compiled\"";
#else
    j += ",\"ble_enabled\":false";
    j += ",\"ble_status\":\"firmware disabled\"";
#endif
    j += ",\"wifi_rssi\":";
    j += hasRssi ? String(rssi) : String("null");
    j += ",\"ap_clients\":" + String(WiFi.softAPgetStationNum());
    j += ",\"temp_c\":";
    if (hasTemp)
    {
        int tempX10 = (int)(tempC * 10.0f + (tempC >= 0 ? 0.5f : -0.5f));
        j += String(tempX10 / 10);
        j += ".";
        j += String(abs(tempX10 % 10));
    }
    else
    {
        j += "null";
    }
    j += "}";
    server.send(200, "application/json", j);
#else
    server.send(200, "application/json", "{\"chip\":\"native\",\"cores\":1}");
#endif
}

#ifdef ESP_PLATFORM
static const char *dashTaskStateName(eTaskState state)
{
    switch (state)
    {
    case eRunning:
        return "RUN";
    case eReady:
        return "READY";
    case eBlocked:
        return "BLOCK";
    case eSuspended:
        return "SUSP";
    case eDeleted:
        return "DEL";
    default:
        return "UNK";
    }
}

static String dashTaskCoreName(BaseType_t core)
{
    if (core == tskNO_AFFINITY)
        return "any";
    return String((int)core);
}

static BaseType_t dashTaskCore(TaskHandle_t handle)
{
    if (!handle)
        return tskNO_AFFINITY;
    return xTaskGetCoreID(handle);
}

#if CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS
static constexpr UBaseType_t kMaxTasksForStats = 64;

struct DashTaskSample
{
    const TaskStatus_t *task;
    uint32_t delta;
};

static String dashBuildTaskStatsText(const TaskStatus_t *before,
                                     UBaseType_t beforeCount,
                                     const TaskStatus_t *after,
                                     UBaseType_t afterCount,
                                     uint32_t elapsedMs)
{
    DashTaskSample samples[kMaxTasksForStats];
    UBaseType_t sampleCount = 0;
    uint64_t totalDelta = 0;
    uint32_t idleDelta[2] = {0, 0};

    for (UBaseType_t i = 0; i < afterCount && i < kMaxTasksForStats; i++)
    {
        uint32_t prevCounter = static_cast<uint32_t>(after[i].ulRunTimeCounter);
        bool found = false;
        for (UBaseType_t j = 0; j < beforeCount && j < kMaxTasksForStats; j++)
        {
            if (before[j].xHandle == after[i].xHandle)
            {
                prevCounter = static_cast<uint32_t>(before[j].ulRunTimeCounter);
                found = true;
                break;
            }
        }
        uint32_t nowCounter = static_cast<uint32_t>(after[i].ulRunTimeCounter);
        uint32_t delta = found ? (nowCounter - prevCounter) : 0;
        samples[sampleCount++] = {&after[i], delta};
        totalDelta += delta;

        const char *name = after[i].pcTaskName ? after[i].pcTaskName : "";
        BaseType_t core = dashTaskCore(after[i].xHandle);
        if (strncmp(name, "IDLE", 4) == 0 && core >= 0 && core <= 1)
            idleDelta[core] = delta;
    }

    for (UBaseType_t i = 0; i < sampleCount; i++)
    {
        for (UBaseType_t j = i + 1; j < sampleCount; j++)
        {
            if (samples[j].delta > samples[i].delta)
            {
                DashTaskSample tmp = samples[i];
                samples[i] = samples[j];
                samples[j] = tmp;
            }
        }
    }

    auto pct = [totalDelta](uint32_t delta) -> String {
        if (totalDelta == 0)
            return "0.0";
        uint32_t tenths = static_cast<uint32_t>((static_cast<uint64_t>(delta) * 1000ULL + totalDelta / 2) / totalDelta);
        return String(tenths / 10) + "." + String(tenths % 10);
    };
    auto loadFromIdle = [totalDelta](uint32_t idle) -> String {
        if (totalDelta == 0)
            return "n/a";
        uint32_t perCoreTotal = static_cast<uint32_t>(totalDelta / 2);
        if (perCoreTotal == 0)
            return "n/a";
        uint32_t idlePct = static_cast<uint32_t>((static_cast<uint64_t>(idle) * 100ULL + perCoreTotal / 2) / perCoreTotal);
        if (idlePct > 100)
            idlePct = 100;
        return String(100 - idlePct);
    };

    String out;
    out.reserve(4096);
    out += "ev-open-can-tools task stats\n";
    out += "sample_ms: " + String(elapsedMs) + "\n";
    out += "tasks: " + String(afterCount) + "\n";
    out += "cpu0_load_from_idle: " + loadFromIdle(idleDelta[0]) + "%\n";
    out += "cpu1_load_from_idle: " + loadFromIdle(idleDelta[1]) + "%\n";
    out += "heap_free: " + String(heap_caps_get_free_size(MALLOC_CAP_8BIT)) + " bytes\n";
    out += "heap_largest: " + String(heap_caps_get_largest_free_block(MALLOC_CAP_8BIT)) + " bytes\n\n";
    out += "CPU%   core prio stack state  task\n";
    out += "-----  ---- ---- ----- ------ ----------------\n";

    for (UBaseType_t i = 0; i < sampleCount; i++)
    {
        const TaskStatus_t &t = *samples[i].task;
        String p = pct(samples[i].delta);
        while (p.length() < 5)
            p = " " + p;
        String core = dashTaskCoreName(dashTaskCore(t.xHandle));
        while (core.length() < 4)
            core = " " + core;
        String prio = String((unsigned)t.uxCurrentPriority);
        while (prio.length() < 4)
            prio = " " + prio;
        String stack = String((unsigned)t.usStackHighWaterMark);
        while (stack.length() < 5)
            stack = " " + stack;

        out += p + "  " + core + " " + prio + " " + stack + " ";
        out += dashTaskStateName(t.eCurrentState);
        out += "  ";
        out += t.pcTaskName ? t.pcTaskName : "?";
        out += "\n";
    }

    return out;
}

static String dashBuildTaskStatsTextBlocking()
{
    TaskStatus_t before[kMaxTasksForStats];
    TaskStatus_t after[kMaxTasksForStats];
    configRUN_TIME_COUNTER_TYPE totalBefore = 0;
    configRUN_TIME_COUNTER_TYPE totalAfter = 0;

    UBaseType_t beforeCount = uxTaskGetSystemState(before, kMaxTasksForStats, &totalBefore);
    int64_t startUs = esp_timer_get_time();
    vTaskDelay(pdMS_TO_TICKS(1000));
    int64_t endUs = esp_timer_get_time();
    UBaseType_t afterCount = uxTaskGetSystemState(after, kMaxTasksForStats, &totalAfter);
    return dashBuildTaskStatsText(before, beforeCount, after, afterCount,
                                  static_cast<uint32_t>((endUs - startUs) / 1000));
}
#endif

static void handleTaskStats()
{
#if CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS
    server.send(200, "text/plain; charset=utf-8", dashBuildTaskStatsTextBlocking());
#else
    server.send(200, "text/plain; charset=utf-8", "FreeRTOS runtime stats are not enabled.\n");
#endif
}
#else
static void handleTaskStats()
{
    server.send(200, "text/plain; charset=utf-8", "Task stats are only available on ESP-IDF builds.\n");
}
#endif

#ifdef ESP_PLATFORM
static void dashSerialPrintHelp()
{
    Serial.println();
    Serial.println("ev-open-can-tools serial diagnostics");
    Serial.println("Commands:");
    Serial.println("  help           show this help");
    Serial.println("  system_status  print CPU/heap/WiFi summary");
    Serial.println("  can_status     print CAN/injection summary");
    Serial.println("  task_stats     sample FreeRTOS tasks for 1s asynchronously");
    Serial.println();
}

static void dashSerialPrintSystemStatus()
{
    uint8_t cpu0Load = 0, cpu1Load = 0;
    bool hasCpuLoad = false;
    dashReadCpuLoad(cpu0Load, cpu1Load, hasCpuLoad);

    float tempC = 0.0f;
    bool hasTemp = dashReadTemperature(tempC);
    uint32_t cpuMhz = (static_cast<uint32_t>(esp_clk_cpu_freq()) + 500000UL) / 1000000UL;
    wifi_mode_t wifiMode = WIFI_MODE_NULL;
    esp_wifi_get_mode(&wifiMode);

